
IP over ATM WG                         M. Perez, F. Liaw, D. Grossman,
Internet-Draft                         A. Mankin, E. Hoffman, A. Malis
                                                 Expires in six months


                 ATM Signaling Support for IP over ATM
                     <draft-ietf-ipatm-sig-01.txt>



1.  Status of this Memo

   This memo is an internet draft. Internet Drafts are working documents
   of the Internet Engineering Task Force (IETF), its Areas, and its
   Working Groups. Note that other groups may also distribute working
   documents as Internet Drafts.

   Internet Drafts are draft documents valid for a maximum of six
   months.  Internet Drafts may be updated, replaced, or obsoleted by
   other documents at any time. It is not appropriate to use Internet
   Drafts as reference material or to cite them other than as a "working
   draft" or "work in progress".  Please check the lid-abstracts.txt
   listing contained in the internet-drafts shadow directories on
   nic.ddn.mil, nnsc.nsf.net, nic.nordu.net, ftp.nisc.src.com, or
   munnari.oz.au to learn the current status of any Internet Draft.

2.  Abstract

   This memo describes how implementations of IP over ATM should use ATM
   call control signaling procedures to establish and release ATM
   connections. It is intended to serve implementations of IP and
   multiprotocol interconnection over ATM that use ATM signaling as
   specified in the ATM Forum User-Network Interface (UNI) Specification
   Version 3.0 [ATMF93].  In particular, during development of this
   memo, the IP over ATM working group has focused its activities on the
   Classical IP over ATM model, as described in RFC 1577 [LAUB94];
   therefore particular attention is given to support RFC 1577.

   This document is an implementors guide intended to foster
   interoperability among RFC 1577, RFC 1483, and UNI ATM signaling.  It
   serves as an intermediary role between IP and ATM call control
   signaling which establishes and releases ATM calls/connections on
   behalf of IP.  Specifically, this memo details the coding of ATM
   signaling messages when used to support IP.

   This memo applies to IP hosts and routers which are also ATM
   endsystems. It assumes ATM networks that completely implement the ATM
   Forum UNI Specification Version 3.0.

   Note: An erratum to the UNI 3.0 specification has been produced by
   the ATM Forum Technical Committee, largely for reasons of alignment
   with Recommendation Q.2931. The erratum will be published as the UNI
   3.1 Specification in the summer of 1994.  This memo does not assumes
   the changes to the specification indicated in the erratum but
   attempts to point out the relevant incompatibilities with UNI 3.0.
   Once UNI 3.1 is publicly available, this I-D will be updated to
                                                                [Page 1]


DRAFT                                                         July 1994
   reflect the changes.

3.  Overview

   In a Switched Virtual Connection (SVC) environment, ATM virtual
   channel connections (VCCs) are dynamically established and released
   as needed. This is accomplished using the ATM call/connection control
   signaling protocol, which operates between ATM endsystems and the ATM
   network.  The signaling entities use the signaling protocol to
   establish and release calls (association between ATM endpoints) and
   connections (VCCs).  Signaling procedures include the use of
   addressing to locate ATM endpoints and allocation of resource in the
   network for the connection.  It also provides indication and
   negotiation between ATM endpoints for selection of end-to-end
   protocols and their parameter.  This memo describes how the signaling
   protocol is used in support of IP over ATM, and, in particular, the
   information exchanged in the signaling protocol to effect this
   support.

   IP address to ATM address resolution and routing issue are not in the
   scope of this I-D, and is treated as part of IP in figure 1. These
   issue depend on the  subnet and end-to-end networking model being
   used.  A taxonomy of subnet and end-to-end networking models is pro-
   vided in [COLE94].  The simplest case is the Classical IP over ATM
   model described in RFC 1577.


              +--------------+     +------+     +----------+
              |              |     |      |<--->| IP / ARP |
              |              |<--->| This |     | RFC 1577 |
              |    ATM       |     |  I-D |     +----------+
              |  signaling   |     |      |<--->| RFC 1483 |
              |              |     +------+     +----------+
              |              |   -------------> |  AAL 5   |
              |              |                  +----------+
              |              |   -------------> |   ATM    |
              +--------------+                  +----------+

                                  Figure 1.
                   Relationship of this I-D to IP, RFC 1483,
                         ATM signaling, ATM and AAL5

4.  Use of protocol procedures

   The following requirements are motivated to provide implementation
   guidelines on how multiple ATM connections between peer systems
   should be managed, to prevent connection thrashing and related
   problems.

   The owner of an existing VCC is defined to be the entity within the
   ATM endsystem that establishes the connection.  An ATM endsystem may
   establish an ATM call when it has a datagram to send and either there
   is no existing VCC that it can use for this purpose, it chooses not
   to use an existing VCC, (e.g., for reasons of route optimization or
   quality of service), or the VCC owner does not allow sharing.

                                                                [Page 2]


DRAFT                                                         July 1994
   When two ATM endsystems run multiple protocols, an ATM connection may
   be shared among two or more datagram protocol entities, as long as
   the VCC owner allows sharing, as well as if the encapsulation allows
   proper multiplexing and demultiplexing, (i.e., the LLC/SNAP
   encapsulation or RFC 1490 over FRSSCS).  This indication of sharing a
   VCC MAY be by configuration or via an API.  Similarly, the Internet
   layer supports multiplexing of multiple end-to-end transport session.
   To properly detect idle connection while sharing a VCC among more
   than one higher layer protocol entities, the ATM endsystem SHALL
   monitor the traffic at the lowest multiplexing layer.

   An ATMARP server or client may establish an ATM call when it has a
   datagram to send and either there is no existing VCC that it can use
   for this purpose,  it chooses not to use an existing VCC, or the
   owner of the VCC does not allow sharing. Note that there might be
   VCCs to the destination which are used for IP, but an ARP server
   might prefer to use a separate VCC for ARP only. The ATMARP server or
   client may maintain or release the call as specified in RFC1577.
   However, if the VCC is shared among several protocol entities, the
   ATMARP client or server SHALL not disconnect the call as suggested in
   RFC1577.

   Systems MUST be able to support multiple connections between peer
   systems (without regard to which peer system initiated each
   connection).  They MAY be configured to only allow one such
   connection at a time.

   If a receiver accepts more than one call from a single source, that
   receiver MUST then accept incoming PDUs on the additional
   connection(s), and MAY transmit on the additional connections.
   Receivers SHOULD NOT accept the incoming call, only to close the
   connection or ignore PDUs from the connection.

   Because opening multiple connections is specifically allowed,
   algorithms to prevent connection call collision, such as the one
   found in section 8.4.3.5 of ISO/IEC 8473 [ISO8473], MUST NOT be
   implemented.

   While allowing multiple connections is specifically desired and
   allowed, implementations MAY choose (by configuration) to permit only
   a single connection to some destinations.  Only in such a case, if a
   colliding incoming call is received while a call request is pending,
   the incoming call shall be rejected.  Note that this may result in a
   failure to establish a connection.  In such a case, each system shall
   wait at least a configurable collision retry time in the range 1 to
   10 seconds before retrying.  Systems SHOULD add a random increment,
   with exponential backoff.

   Either endsystem MAY close a connection. If the connection is closed
   or reset while a datagram is being transmitted, the datagram is lost.
   Systems SHOULD be able to configure a minimum holding time for
   connections to remain open as long as the endpoints are up.  (Note
   that holding time, the time the connection has been open, differs
   from idle time.)  A suggested default value for the minimum holding
   time is 60 seconds.

                                                                [Page 3]


DRAFT                                                         July 1994
   Because some public networks may charge for connection holding time,
   and connections may be a scarce resource in some networks or
   endsystems, each system implementing a Public ATM UNI interface MUST
   support the use of a configurable inactivity timer to clear
   connections that are idle for some period of time.  The timer's range
   SHOULD include a range from a small number of minutes to "infinite",
   and the default value SHOULD be "infinite".  Systems which only
   implement a Private ATM UNI interface SHOULD, but are not required
   to, support the inactivity timer.  If implemented, the inactivity
   timer shall monitor traffic of both receiving and transmitting
   activities.


5.  Brief Overview of UNI Call Setup Signaling Procedures and Messages

   This section provides a summary of point-to-point signaling
   procedures. Readers are referred to [ATMF93] and [Q2931].

   UNI signaling messages used for point-to-point call connection
   control are the following:

               Call Setup                       Call Release
               ----------                       ------------
                 SETUP                             RELEASE
                 CALL PROCEEDING                   RELEASE COMPLETE
                 CONNECT
                 CONNECT ACKNOWLEDGE


   An ATM endpoint initiates a call request by sending a SETUP message
   to the network. The network processes the call request to determine
   if the call can be progressed. If so, the network indicates the value
   of the newly allocated VPCI/VCI in its first response to the the
   SETUP message, which may either be a CALL PROCEEDING or CONNECT
   message. If a call cannot be accepted, by the network or destination
   ATM endpoint, a RELEASE COMPLETE is sent.  At the destination ATM
   endpoint, the network offers the call using the SETUP message.  If
   the destination endpoint is able to accept the call, it responds with
   a CONNECT message; otherwise, it sends a RELEASE COMPLETE message.

   Release can be initiated by either endpoint or (rarely) by the
   network.  When an endpoint wishes to release a call, it sends a
   RELEASE message to the network. The network responds with a RELEASE
   COMPLETE message, frees up resources associated with the call, and
   initiates clearing toward the other endpoint. The network initiates
   clearing by sending a RELEASE message to the ATM endpoint, which
   reponds by sending a RELEASE COMPLETE message.  Upon receipt of the
   RELEASE COMPLETE message, the network frees any resources associated
   with the call.


6.  Overview of call establishment message content

   Signaling messages are structured to contain mandatory and optional
   variable length information elements (IEs).  IEs are further
   subdivided into octet groups, which in turn are divided into fields.
                                                                [Page 4]


DRAFT                                                         July 1994
   IEs contain information related to the call, which may be relevant to
   the network, the peer endpoint or both.  Selection of optional IEs
   and the content of mandatory and optional IEs in call establishment
   message determines the parties to and nature of the communication
   over the ATM connection. For example, the call establishment message
   for a call which will be used for constant bitrate video over AAL 1
   will have different contents than a call which will be used for IP
   over AAL 5.

   A SETUP message which establishes an ATM connection to be used for IP
   and multiprotocol interconnection calls SHALL contain the following
   IE:

        AAL Parameters
        ATM User Cell Rate (ATM Traffic Descriptor in UNI 3.1 erratum)
        Broadband Bearer Capability
        Broadband Low Layer Information
        QoS Parameter
        Called Party Number
        Calling Party Number

   and may, under certain circumstance contain the following IEs :

        Calling Party Subaddress
        Called Party Subaddress
        Transit Network Selection

   In UNI 3.0 the AAL Parameters and the Broadband Low Layer Information
   IEs are optional in a SETUP message.  However, in support of IP over
   ATM these two IEs MUST be included. Annex A shows an example SETUP
   message coded in the manner indicated in this draft.

7.  Information Elements with Endpoint to Endpoint Significance

   This section describes the coding of, and procedures surrounding,
   information elements in a SETUP message with significance only to the
   endpoints of an ATM call supporting IP and multiprotocol operation.


7.1.  ATM Adaption Layer Parameters

   The AAL Parameters IE (see section 5.4.5.5 and Annex F of [ATMF93])
   carries information about the ATM Adaption Layer (AAL) to be used on
   the connection. RFC 1483 specifies encapsulation of IP over AAL 5.
   Thus, AAL 5 SHALL be indicated in the "AAL type" field.

   Coding and procedure related to the 'Forward and Backward Maximum
   CPCS-SDU Size' fields are discussed in [ATKI94].

   The 'mode' field SHOULD be omitted from the AAL Parameters IE.  If
   present it is appropriate to set it to "message" mode, as opposed to
   "streaming" mode. Nevertheless, it SHALL be ignored by the
   destination endsystem.

   Ordinarily, no Service Specific Convergence Sublayer (SSCS) will be
   used for multiprotocol interconnect over AAL5.  Therefore, the SSCS
                                                                [Page 5]


DRAFT                                                         July 1994
   The exception will occur in the event that the network provides
   interworking between ATM and Frame Relay.  In this case, the ATM
   endsystem will receive a SETUP or CONNECT message containing an AAL
   Parameters IE with the SSCS Type field coded as Frame Relay SSCS.
   The call SHALL be cleared with cause #93, AAL Parameters not
   supported unless the ATM endsystem supports RFC 1490 encapsulation
   over FRSSCS, and a Broadband Low Layer Information IE is coded to
   indicate RFC 1490 encapsulation (see below).


          Format and field values of AAL Parameters IE

          ----------------------------------------------------------
          | aal_parameters                                         |
          ----------------------------------------------------------
          |  aal_type                    5        (AAL 5)          |
          |  fwd_max_sdu_size_identifier 140                       |
          |  fwd_max_sdu_size            9188     (default IP MTU) |
          |  bkw_max_sdu_size_identifier 129                       |
          |  bkw_max_sdu_size            9188     (default IP MTU) |
          |  sscs_type identifier        132                       |
          |  sscs_type                   0        (null SSCS)      |
          ----------------------------------------------------------


7.2.  Broadband Low Layer Information

   Selection of an encapsulation to support IP and multiprotocol
   interconnection over an ATM VCC is done using the Broadband Low Layer
   Information (B-LLI) IE, along with the AAL Parameters IE, and the B-
   LLI negotiation procedure.

   Protocol encapsulation for multiprotocol interconnection over ATM ALL
   5 is specified in RFC 1483.  Three encapsulation are provided; these
   are:

     (a) LLC/SNAP encapsulation
     (b) VC-multiplexing (null encapsulation)
     (c) Use of RFC 1490 over the Frame Relay Service Specific
         Convergence Sublayer (FRSSCS)

   The example codings for the B-LLI IE provided in Appendix D of the
   ATM Forum UNI 3.0 specification were selected to correspond to the
   RFC 1483 encapsulations.

   RFC 1577 specifies LLC/SNAP as the default encapsulation. Therefore
   LLC encapsulation SHOULD be indicated in the B-LLI as shown in figure
   D.3.1 of [ATMF93]. Signaling indication of other encapsulations is
   discussed in the next section. Note that in this case only LLC is
   indicated in the B-LLI. It is up to the LLC layer to look into the
   encapsulation header of the packet. If the SNAP header indicates IP,
   it is the LLC layer's job to hand the packet up to IP.


          Format of B-LLI IE indicating LLC/SNAP encapsulation

                                                                [Page 6]


DRAFT                                                         July 1994
          ----------------------------------------------------------
          | bb_low_layer_information                               |
          ----------------------------------------------------------
          |  layer_2_id                 2                          |
          |  user_information_layer     12  (lan_llc - ISO 8802/2) |
          ----------------------------------------------------------


7.2.1.  Encapsulation negotiation

   The call/connection control signaling protocol includes a mechanism
   to support negotiation of encapsulation for endsystems that support
   more than one. This section describes the procedures for negotiation
   of an encapsulation.

   As stated in the previous section, this I-D requires that hosts and
   router which are ATM endsystems implement LLC/SNAP encapsulation.
   Nevertheless, RFC 1483 also specifies VC-multiplexing and recognizes
   use of RFC 1490 over FRSSCS. VC-multiplexing SHOULD be implemented to
   achieve maximum interoperability.  Implementation of RFC 1490
   encapsulation over FRSSCS is also recommended for interworking with
   Frame Relay networks.  Such interworking does have its problems
   however as discussed later.

   The B-LLI negotiation procedures (see Annex C of [ATMF93]) are
   initiated by the calling ATM endsystem by including up to three
   instance of the B-LLI IE in the SETUP message in descending order of
   preference (following the rule for repeating IE in section 5.4.5.1 of
   [ATMF93]).

   The following is the list of the three possible combinations that B-
   LLI IE instances may be included in the SETUP message.  Each instance
   is referred to by its encapsulation name as it appears in RFC 1483,
   and corresponding section labels from ATM Forum UNI 3.0
   specification.

     a) LLC/SNAP encapsulation (D.3.1)

     In this case, the calling ATM endsystem can only send and receive
   packets preceded by an LLC/SNAP identification.

     b) VC-multiplexing (D.3.2) and LLC/SNAP (D.3.1)

     The calling ATM endsystem prefers to use VC multiplexing, but is
   willing to agree to use LLC/SNAP encapsulation instead, if the called
   ATM endsytem only supports LLC/SNAP.

     c) RFC 1490 encapsulation (MLPID multiplexing) over FRSSCS
       (D.3.3, omitting octets 7a and 7b and MUST have FR-SSCS in SSCS
   type of AAL Parameters IE.)

     The calling ATM endsystem can only send and receive packets using
   RFC 1490 encapsulation (NLPID multiplexing) over FRSSCS. Use of RFC
   1490 encapsulation presently cannot be negotiated as an alternative
   to LLC encapsulation or VC-multiplexing (see Appendix B). If the B-
   LLI IE is encoded to indicate RFC 1490 encapsulation, the SSCS type
                                                                [Page 7]


DRAFT                                                         July 1994
   field of the AAL Parameters IE SHALL coded to indicate FRSSCS. Note
   that the AAL Parameters IE can not be coded to indicate both NULL and
   FR-SSCS and neither LLC encapsulation nor VC-multiplexing will be
   interoperable when used over FR-SSCS.

   The called ATM endsystem SHALL select the encapsulation method it is
   able to support from the B-LLI IE present in SETUP message.  If it
   supports more than one of the encapsulations indicated in the SETUP
   message, it MUST select the one which appears first in the SETUP
   message.  The called ATM endsystem then includes the B-LLI IE content
   corresponding to the selected encapsulation in the CONNECT message.
   If the called endsystem does not support any encapsulation indicated
   in the incoming SETUP message, it SHALL clear the call with cause
   #88, incompatible destination.  If the received SETUP message does
   not include the B-LLI IE, the call SHALL be cleared with cause #21,
   "call rejected", with diagnostics indicating rejection reason =
   information element missing and the B-LLI IE identifier.  As
   described in Annex C of [ATMF93], if the calling ATM endpoint
   receives a CONNECT message that does not contain a B-LLI IE, it SHALL
   assume the encapsulation indicated in the first BLLI IE that it
   included in the SETUP message.


7.2.2.  Framework for Protocol Layering

   The support of connectionless services from a connection oriented
   link layer exposes general problems of connection management,
   specifically the problems of connection acceptance, assignment of
   quality of service, and connection shutdown. For a connection to be
   associated with the correct protocol on the called host, it is
   necessary for information about one or more layers of protocol
   identification to be associated with a connection "management entity"
   or "endpoint". This association is what we call a binding in this
   draft.  In this section we attempt to describe a framework for a
   usable binding or service architecture given the available IEs in the
   ATM call control messages.

   It is important to distinguish between two basic uses of protocol
   identification elements present in the UNI setup message. The first
   is the description of the protocol encapsulation that will be used on
   the data packet over the virtual connection, the second is the entity
   that will be responsible for managing the call. All protocols present
   in various IEs should be used to encapsulate the call, but the most
   specific, or highest, layer specified should manage the call. This
   defines a hierarchy of services and provides a framework for
   applications, including LLC and IP, to terminate calls. The hierarchy
   provides a clear mechanism for support of higher level protocol and
   application bindings, when their use and specification is defined in
   the appropriate standards bodies.

   The B-LLI is the only information element currently available in UNI
   3.0 for designating the application endpoint. It contains codepoints,
   which describe layer 2 and layer 3 protocols entities associated with
   the call. There are other information elements under consideration in
   the ATM Forum and ITU, which could come to play a significant role in
   the description of application to connection binding, but their use
                                                                [Page 8]


DRAFT                                                         July 1994
   is not currently sanctioned by the Forum, and they are not part of
   the framework described by RFC1577. They include B-HLI, for
   containing information for a higher layer protocol, Network Layer
   Information (NLI) to contain information for the network layer, and
   UUI, which is meant to carry information for use by the top level
   application.

   In general, it would be desirable to allow data packets to be stored
   directly into applications address space after connection is
   established.  This is possible only if we have both forward and
   backward encapsulation indication in the signaling message.

   To support multiprotocol encapsulation, the LLC protocol management
   entity should accept all connections directed specifically to it. For
   each connection that is terminated at LLC, all protocols that are
   intended to be supported by this host through that interface should
   be made available. Termination of the call is at the discretion of
   the LLC connection management entity, based on the information it has
   available to it, specifically the perceived packet traffic and
   administrative policies of the host.

   VC-multiplexed IP is specified by using only the layer 3 identifier
   in B-LLI using an ISO-TR-9577 protocol codepoint.  Since no layer 2
   is specified, frames produced by AAL processing will be given
   directly to IP. Since IP is highest specified protocol, it will be
   responsible for managing the connection.


8.  Information Elements with Significance to the ATM Network

   This section describes the coding of, and procedures surrounding,
   information elements with significance to the ATM network, as well as
   the endpoints of an ATM call supporting multiprotocol operation.

   The standards, implementation agreements, research and experience
   surrounding such issues as traffic management, quality of service and
   bearer service description are still evolving.  Much of this material
   is cast so as to give the greatest possible latitude to ATM network
   implementation and service offerings.  ATM endsystems need to match
   the traffic contract and bearer service they request from the network
   to the capabilities offered by the network.  Therefore, this memo can
   only offer what, at the present time, are the most appropriate and
   efficient coding rules to follow for setting up IP and ATMARP VCCs.

8.1.  ATM User Cell Rate

   The ATM Traffic descriptor is contained in the ATM User Cell Rate IE
   (called ATM Traffic Descriptor in UNI 3.1 erratum).  It characterizes
   the ATM virtual connection in terms of peak cell rate (PCR),
   sustainable cell rate (SCR), and maximum burst size.  This
   information is used to allocate resources (e.g., bandwidth,
   buffering) in the network.  In general, the ATM traffic descriptor
   for supporting multiprotocol interconnection over ATM will be driven
   by factors such as the capacity of the network, conformance
   definition supported by the network, performance of the ATM endsystem
   and (for public networks) cost of services.
                                                                [Page 9]


DRAFT                                                         July 1994
   The most convenient model of IP behavior corresponds to the Best
   Effort Capability (see section 3.6.2.4 of [ATMF93]). If this
   capability is offered by the ATM network(s), it SHOULD be requested
   by including the Best Effort Indicator, the peak cell rate forward
   (CLP=0+1) and peak cell rate backward (CLP=0+1) fields in the ATM
   User Cell Rate IE.

          Format and field values of ATM User Cell Rate IE

          ----------------------------------------------------------
          | user_cell_rate                                         |
          ----------------------------------------------------------
          |  fwd_peak_cell_rate_0+1_identifier    132              |
          |  fwd_peak_cell_rate_0+1               (link rate)      |
          |  bkw_peak_cell_rate_0+1_identifier    133              |
          |  bkw_peak_cell_rate_0+1               (link rate)      |
          |  best_effort_indication               190              |
          ----------------------------------------------------------


   [ATMF93] does not provide any capability for negotiation of the ATM
   User Cell Rate.  This means that:

     a) the calling endsystem SHOULD have a "pretty good idea" as to the
   traffic contract that will be acceptable to both the called endsystem
   and the network.

     b) if, in response to a SETUP message, a calling endsystem receive
   a RELEASE COMPLETE message, or a CALL PROCEEDING message followed by
   a RELEASE COMPLETE message, with cause #51, User cell rate
   unavailable, it MAY examine the diagnostic field of the Cause IE and
   reattempt the call after selecting smaller values for the
   parameter(s) indicated.  If the RELEASE COMPLETE or RELEASE message
   is received with cause #73, Unsupported combination of traffic
   parameter, it MAY try other combinations from table 5-7 and 5-8 of
   [ATMF93].

     c) the called endsystem SHOULD examine the ATM traffic descriptor
   IE in the SETUP message.  If it is unable to process cells at the
   Forward PCR indicated, it should clear the call cause #51, User cell
   rate unavailable.


8.2.  Broadband Bearer Capability

   Broadband Bearer Connection Oriented Service Type X (BCOB-X) or Type
   C (BCOB-C) are applicable for multiprotocol interconnection,
   depending on the service(s) provided by the ATM network and the
   capabilities (e.g. for traffic shaping) of the ATM endsystem.  The
   example coding of Broadband Bearer Capability in figure D.2.1 of
   [ATMF93] applies for BCOB-C.  When BCOB-X is specified, the "traffic
   type" and "timing requirements" fields SHALL both be set to "no
   indication".  The susceptibility to clipping and User plane traffic
   configuration SHALL be set to "not susceptible to clipping" and
   "point-to-point", respectively.

                                                               [Page 10]


DRAFT                                                         July 1994
          Format and field values of Broadband Bearer Capability IE

          ----------------------------------------------------------
          | bb_bearer_capability                                   |
          ----------------------------------------------------------
          |  spare                       0                         |
          |  bearer_class                16      (BCOC-X)          |
          |  spare                       0                         |
          |  traffic_type                0       (no indication)   |
          |  timing_reqs                 0       (no indication)   |
          |  susceptibility_to_clipping  0       (not suscept)     |
          |  spare                       0                         |
          |  user_plane_configuration    0       (point_to_point)  |
          ----------------------------------------------------------


   [ATMF93] does not provide any capability for negotiation of the
   broadband bearer capability.  This means that:

     a) the calling endsystem SHOULD have a "pretty good idea" as to the
   broadband bearer capability that will be acceptable to both the
   called endsystem and the network.

     b) if, in response to a SETUP message, a calling endsystem receives
   a RELEASE COMPLETE message, or a CALL PROCEEDING message followed by
   a RELEASE COMPLETE message, with cause #57, bearer capability not
   authorized or #58 bearer capability not presently available, it MAY
   reattempt the call after selecting another bearer capability.


8.3.  QoS Parameter

   The Unspecified QoS class (Class 0), the Specified QoS Class for
   Connection Oriented Data Transfer (Class 3) or the Specified QoS
   Class for Connectionless Data Transfer (Class 4)  may be applicable
   to multiprotocol over ATM.  The available combination of QoS
   parameters with the ATM User Cell Rate and the Broadband Bearer
   Capability is specific to the ATM network.

          Format and field values of QoS Parameters IE

          ----------------------------------------------------------
          | qos_parameter                                          |
          ----------------------------------------------------------
          |  qos_class_fwd              0         (class 0)        |
          |  qos_class_bkw              0         (class 0)        |
          ----------------------------------------------------------


   [ATMF93] does not provide any capability for negotiation of Quality
   of Service parameters.  This means that:

     a) the calling endsystem SHOULD have a "pretty good idea" as to the
   QoS classes offered by the ATM network in conjunction with the
   requested Broadband Bearer Service and traffic descriptor.

                                                               [Page 11]


DRAFT                                                         July 1994
     b) if, in response to a SETUP message, a calling endsystem receives
   a RELEASE COMPLETE message, or a CALL PROCEEDING message followed by
   a RELEASE COMPLETE message, with cause #49, Quality of Service
   unavailable, it MAY reattempt the call after selecting another QoS
   class.

   Note: In UNI 3.1 a new code point of '00' has been added to the
   coding standard field in the IE header. This code point has been
   added for compatibility with Q.2931 and is to be used when indicating
   the Unspecified QoS class (class 0). Therefore, the coding standard
   field SHALL be set to '00' when indicating QoS class 0, as is
   suggested for IP.


8.4.  ATM Addressing information

   ATM addressing information is carried in the Called Party Number,
   Calling Party Number, and, under certain circumstance, Called Party
   Subaddress, and Calling Party Subaddress IE.  Section 5.1.3 and Annex
   A of [ATMF93] describes the syntax and semantics of ATM addressing
   information, including use of the subaddress IE.  Section 5.8 of
   [ATMF93] provides the procedure for an ATM endsystem to learn its own
   ATM address from the ATM network, for use in populating the Calling
   Party Number IE.

   Resolution of IP address to an ATM address is required of hosts and
   router which are ATM endsystems that use ATM SVCs. RFC 1577 provides
   a mechanism for doing IP to ATM address resolution in the classical
   IP model.

          Format and field values of Called Party Number IE

          ----------------------------------------------------------
          | called_party_number                                    |
          ----------------------------------------------------------
          |  type_of_number      (international number / unknown)  |
          |  addr_plan_ident     (ISDN / ISO NSAPA)                |
          |  number              (E.164 / OSI NSAPA)               |
          ----------------------------------------------------------


          Format and field values of Calling Party Number IE

          ----------------------------------------------------------
          | calling_party_number                                   |
          ----------------------------------------------------------
          |  type_of_number      (international number / unknown)  |
          |  addr_plan_ident     (ISDN / ISO NSAPA)                |
          |  presentation_indic  (presentation allowed)            |
          |  spare               0                                 |
          |  screening_indic     (user provided verified & passed) |
          |  number              (E.164 / OSI NSAPA)               |
          ----------------------------------------------------------



                                                               [Page 12]


DRAFT                                                         July 1994
9.  Dealing with Failure of Call Establishment

   If an ATM call attempt fails with any of the following cause, the
   situation SHALL be treated as "network unreachable" (if the called
   ATM endsystem is a router) or "host unreachable" (if the called ATM
   endsystem is a host).

        #  1  unallocated (unassigned) number
        #  3  no route to destination
        # 17  user busy
        # 18  no user reponding
        # 27  destination out of order
        # 38  network out of order
        # 41  temporary failure
        # 47  resource unavailable, unspecified

   If an ATM call attempt fails with any of the following causes, the
   ATM endpoint may retry the call, changing (or adding) the IE(s)
   indicated by the cause code and diagnostic.

        #  2  no route to specified transit network
        # 21  call rejected
        # 22  number changed
        # 23  user rejects call with CLIR
        # 49  quality of service unavailable
        # 51  user cell rate unavailable
        # 57  bearer capability not authorized
        # 58  bearer capability not presently available
        # 65  bearer capability not implemented
        # 73  unsupported combination of traffic parameter
        # 88  incompatible destination
        # 91  invalid transmit network selection
        # 93  AAL parameter cannot be supported

   Any cause in the protocol error class (value 96 to 111) where the
   location is either private network serving the local user or public
   network serving the local user

10.  Security Consideration

   Security consideration are not addressed in this memo.

11.  Acknowledgments


   The authors wish to thank the work of their colleagues who attend the
   IP over ATM working group;  the ATM Forum Technical Committee;  the
   ATM Signaling Subworking Group in ANSI-Accredited Technical
   Subcommittee T1S1;  the ATM Access Signaling experts in ITU-T
   (formerly CCITT) Study Group 11. Rao Cherukuri (IBM) and Jeff Kiel
   (formerly with Bellcore, presently with BellSouth) were particularly
   valuable in coordinating among T1S1, ITU-T and the ATM Forum to make
   sure that the needs of multiprotocol over ATM could be expressed in
   the ATM signaling protocol.


                                                               [Page 13]


DRAFT                                                         July 1994
   References

   [ATKI94] Atkinson, R., "RFC 1626: IP MTU over ATM AAL5", Naval
   Research Laboratory, May 94

   [ATMF93] ATM Forum, "ATM User-Network Interface Specification Version
   3.0", (Englewood Cliffs, NJ: Prentice Hall, 1993)

   [COLE94] IP over ATM: A Framework Document Internet Draft

   [HEIN93] Heinanen, J., "Multiprotocol Encapsulation over ATM Adaption
   Layer 5", RFC 1483, USC/Information Science Institute, July 1993.

   [ISO8473] ISO/IEC 8473, Information processing systems - Data
   communications - Protocol for providing the connectionless-mode
   network service, 1988.

   [ISO9577] Information Technology - Telecommunication and information
   exchange between systems - Protocol identification in the network
   layer ISO/IEC TR9577 (International Standards Organization: Geneva,
   1990)

   [LAUB93] Laubach, M., "Classical IP and ARP over ATM", RFC1577,
   Hewlett-Packard Laboratories, December 1993

   [Q.2931] Broadband Integrated Service Digital Network (B-ISDN)
   Digital Subscriber Signaling System No.2 (DSS2) User Network
   Interface Layer 3 Specification for Basic Call/Connection Control
   ITU-T Recommendation Q.2931, (International Telecommunication Union:
   Geneva, 1994) (to be published March, 1994)


























                                                               [Page 14]



Appendix A.  Frame Relay Interworking

   1.  SSCS vs. LLC

      Procedures for Frame Relay to ATM signaling interworking have not yet
      been specified by ITU-T, the ATM Forum, or the Frame Relay Forum. If
      an ATM endsystem wishes to use FR-SSCS, FR-SSCS and RFC 1490
      encapsulation must both be be specified in the SETUP message.
      Nevertheless, since neither LLC encapsulation nor VC-multiplexing
      will interoperate when used over FR-SSCS, these two encapsulations
      cannot be negotiated as alternatives to RFC 1490 encapsulation.

      In ATM environments the SSCS layer is part of the AAL functionality.
      The SSCS serves to coordinate the needs of a protocol above with the
      requirements of next lower layer, the Common Part Convergence
      Sublayer (CPCS). For example, the UNI ATM signaling protocol runs on
      top of a signaling SSCS which among other things provides an assured
      transfer service for signaling messages. Since the SSCS is considered
      part of the AAL, the SSCS type is specified as one of the parameters
      in the AAL Parameters IE.  To date there has not been an SSCS defined
      for data transmission in ATM and this type field is usually set to
      'null'.

      The exception occurs when doing FR interworking where an ATM
      endsystem may choose to use the FR-SSCS over AAL 5 in order to
      communicate with a FR endsystem.  In that case the SSCS type in the
      AAL Parameters IE of the SETUP message is set to 'FR-SSCS'.

      Also included in a SETUP message is an indication in the B-LLI IE of
      the protocol layers to be used above the AAL. In particular, ATM
      connections established to carry connectionless network interconnect
      traffic require a layer above the AAL for multiplexing multiple
      protocols over a single VC [HEIN 93]. As mentioned above, RFC 1577
      defines LLC as default multiplexing layer for IP over AAL5.

      Specification of the SSCS restricts the encapsulation protocol used
      over it, since RFC 1483 (in addition to applicable ITU standards)
      requires the use of RFC 1490 encapsulation over the FR-SSCS, and LLC
      or null encapsulation otherwise.  The fact that it is not possible,
      in the UNI 3.1 signaling specification, to negotiate between the FR-
      SSCS and null SSCS can result in interoperability restrictions
      between stations that implement and wish to use the FR-SSCS and those
      that do not, even though they both are using IP. The guidelines in
      the following section were developed to decrease the chance that such
      interoperability restrictions occur.

      2.  Scenarios for Interworking


      The following discussion uses the terms "network interworking" and
      "service interworking".  "Network interworking" uses FR-SSCS over
      AAL5 between the InterWorking Unit (IWU) and the ATM endsystem, and
      the ATM endsystem is aware that the other endpoint is a FR/ATM
      Network IWU.  "Service interworking" aims to make the operation
      transparent to the ATM endsystem by adding encapsulation translation
      and other payload processing in the FR/ATM Service IWU to allow the
                                                               [Page 15]


DRAFT                                                         July 1994
   ATM endsystem to operate as if it were talking to another ATM
   endsystem.

   The most common scenario where FR-SSCS could be negotiated is between
   an ATM endsystem and a FR/ATM network IWU to allow connectivity among
   an ATM endsystem and a FR endsystem residing behind a FR/ATM network
   IWU.


                     --------        --------
      -------       |        |      |        |       -------
     |   A   |      | FR/ATM |      |   ATM  |      |   B   |
     |  (FR) |----->|  IWU   |----->| switch |----->| (ATM) |
      -------       |        |      |        |       -------
                     --------        --------

             |      |        |                      |
              ----->          --------------------->
             FR call                 ATM call


   A network IWU can place a call to an ATM host (on behalf of a FR
   host) by signaling for FR-SSCS and assuming that the ATM endsystem
   supports FR-SSCS. The B-LLI IE SHALL be encoded to indicate RFC 1490
   encapsulation and the SSCS type field of the AAL Parameters IE SHALL
   be coded to indicate FR-SSCS.  If the FR-SSCS negotiation fails
   because the called ATM host does not support FR-SSCS, the IWU can
   retry the call negotiating for LLC encapsulation or VC-multiplexing.
   However, the IWU can only attempt the retry if it is able to do FR-
   ATM service interworking. Such service interworking adds extra
   processing overhead during the call.

   The even more problematic case occurs when a call is requested in the
   opposite direction, i.e. when an ATM host places a call to a host
   residing behind an IWU.

                     --------        --------
      -------       |        |      |        |       -------
     |   B   |      | FR/ATM |      |   ATM  |      |   A   |
     |  (FR) |<-----|  IWU   |<-----| switch |<-----| (ATM) |
      -------       |        |      |        |       -------
                     --------        --------

             |      |        |                      |
              <-----          <---------------------
             FR call                 ATM call



   Not knowing that the destination resides behind an IWU, the calling
   host will negotiate for the default LLC encapsulation (possibly
   requesting VC-multiplexing as an alternative).  In this situation the
   IWU can accept the call and do the necessary service interworking or
   reject the call specifying 'AAL Parameters not supported'. If the IWU
   rejects the call it risks the possibility that calling host does not
   support FR-SSCS or simply does not retry and the call will never be
                                                               [Page 16]


DRAFT                                                         July 1994
   established.

   3.  Possible Alternatives


   While Frame Relay interworking is possible, it is not possible to
   negotiate FR-SSCS with LLC encapsulation or VC-multiplexing, which
   decreases the chances of completing an ATM call.  However,
   interoperability can be increased using the following alternatives:

   1. Maintaining external knowledge that a particular destination uses
   FR-SSCS.  This knowledge can be configured, or in the future added to
   some network host database.

   2. In the absence of such external knowledge, an ATM endsystem is
   required to negotiate for the default LLC encapsulation (possibly
   requesting VC-multiplexing as an alternative).  There are three
   subcases:

   2a. The IWU supports service interworking and network interworking,
   and prefers service interworking.  The IWU simply accepts the call
   using LLC encapsulation.

   2b. The IWU supports service interworking and network interworking,
   and prefers network interworking.  The IWU simply accepts the call,
   but attempts to open a parallel connection back to the original ATM
   endsystem negotiating the FR-SSCS use.  If the connection is
   accepted, the IWU closes the service interworking connection.

   2c. The IWU supports network interworking only.  The IWU rejects the
   call specifying 'AAL Parameters not supported', and then attempts to
   open a connection back to the original ATM endsystem negotiating the
   FR-SSCS use.























                                                               [Page 17]


Appendix B. Sample Signaling Messages

This annex shows sample codings of the SETUP and CONNECT signaling messages. 
The fields in the IE header are not shown.

   +--------------------------------------------------------------------+
                                 SETUP       

     Information Elements/
       Fields                         Value/(Meaning)                 
     --------------------             ---------------

     aal_parameters
       aal_type                       5        (AAL 5)        
       fwd_max_sdu_size_ident         140
       fwd_max_sdu_size               9188     (default, send IP MTU value)
       bkw_max_sdu_size_ident         129
       bkw_max_sdu_size               9188     (default, recv IP MTU value)
       mode identifier                131 *
       mode                           message *
       sscs_type identifier           132
       sscs_type                      0        (null SSCS)

     user_cell_rate
       fwd_peak_cell_rate_0_1_ident   132
       fwd_peak_cell_rate_0_1         (link rate)
       bkw_peak_cell_rate_0_1_ident   133
       bkw_peak_cell_rate_0_1         (link rate)
       best_effort_indication         190 

     bb_bearer_capability
       spare                          0
       bearer_class                   16       (BCOC-X)
       spare                          0
       traffic_type                   0        (no indication)
       timing_reqs                    0        (no indication) 
       susceptibility_to_clipping     0        (not susceptible to clipping)
       spare                          0
       user_plane_configuration       0        (point_to_point)

     bb_low_layer_information
       layer_2_id                     2    
       user_information_layer         12       (lan_llc (ISO 8802/2)

     qos_parameter
       qos_class_fwd                  0        (class 0)
       qos_class_bkw                  0        (class 0)

     called_party_number
       type_of_number                 (international number / unknown)
       addr_plan_ident                (ISDN / ISO NSAPA)
       number                         (E.164 / OSI NSAPA)

     calling_party_number
       type_of_number                 (international number / unknown)
       addr_plan_ident                (ISDN / ISO NSAPA)
       presentation_indic             (presentation allowed)
       spare                          0
       screening_indic                (user_provided verified and passed)
       number                         (E.164 / OSI NSAPA)

   +--------------------------------------------------------------------+
                               Figure 1.
                       Sample contents of SETUP message

   [* : optional, ignored if present]
                                                               [Page 18]


DRAFT                                                          July 1994


In IP over ATM environments the inclusion of the "AAL parameters" IE 
is *mandatory* to allow for MTU size negotiation between the source
and destination. The "Broadband Low Layer Information" IE is also
mandatory for specifying the IP encapsualtion scheme.


   +--------------------------------------------------------------------+
                                 CONNECT       

     Information Elements/
       Fields                         Value                  
     --------------------             -----
     aal_parameters
       aal_type                       5        (AAL 5)        
       fwd_max_sdu_size_ident         140
       fwd_max_sdu_size               9188     (default, send IP MTU value)
       bkw_max_sdu_size_ident         129
       bkw_max_sdu_size               9188     (default, recv IP MTU value)
       mode identifier                131 *
       mode                           message *
       sscs_type identifier           132

     bb_low_layer_information
       layer_2_id                     2    
       user_information_layer         12       (lan_llc (ISO 8802/2)

     connection identifier
       spare                          0
       vp_assoc_signaling             1        (explicit indication of VPCI)
       preferred_exclusive            0        (exclusive vpci/vci)
       vpci                           (assigned by network)
       vci                            (assigned by network)
   +--------------------------------------------------------------------+
                                Figure 2.
                     Sample contents of CONNECT message


As in the SETUP message, IP over ATM environments demand the inclusion 
of the "AAL parameters" IE so that the destination may specify the 
MTU size that it is willing to receive.



